from html import escape


def mention(uid: int, name: str | None = None) -> str:
    name = (name or str(uid)).strip()
    return f'<a href="tg://user?id={uid}">{escape(name)}</a>'


class TextModel:
    START_MESSAGE = """
Привіт! 👋

🎮 Я уно-бот, зі мною не вдасться засумувати, знаходь, 
або запрошуй друзів та змагайтеся за нагороди та призи, буде весело! 💥
"""
    GROUP_GAME_MESSAGE = """
✅ Щоб зіграти в групі, додай бота до групи та використай команду /uno в ній.
"""
    PROFILE_MESSAGE = """Мій профіль 🎮

👤 Ім'я: <b>{0}</b>
🎲 Кількість зіграних ігор: <b>{1}</b>
🏆 Кількість перемог: <b>{2}</b>

💎 Рівень: <b>{3}</b> lvl
🧩 Досвід: <b>{4}</b>/<b>{5}</b> XP -> <b>{6}</b> lvl

💰 Монети: <b>{7}</b>

📆 Дата реєстрації: <i>{8}</i>"""
